<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f3a1914cbcb5a75504fca4f8a3587779f0b2298f3511a7d79d1e23c3379ea1c0","plan_job_ref":"Job Plan Airflow DAGs #220 at https://github.com/cal-itp/data-infra/actions/runs/16203159763","plan_out_hash":"bc952f12f8dadbc2df15643922130789ebe7eae23c39cc1efec007848202cbbc","plan_hash":"ad22b0cfbae9370b582ded0e3997b7f6fc3b74b1e8ba544609ed21b55a819ffc","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/hooks/transitland_hook.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/hooks/transitland_hook.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/hooks/transitland_hook.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["plugins/libs/__init__.py"] will be destroyed
  # (because key ["plugins/libs/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416674772489 -> null
-       id                  = "calitp-composer-plugins/libs/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       md5hexhash          = "d41d8cd98f00b204e9800998ecf8427e" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/plugins%2Flibs%2F__init__.py?generation=1751416674772489&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/libs/__init__.py" -> null
-       output_name         = "plugins/libs/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/plugins%2Flibs%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/libs/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/aggregator_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "ig+/LA==" -> (known after apply)
!~      detect_md5hash      = "XJkgbCLPyivP+4iiIstZYw==" -> "different hash"
!~      generation          = 1752161967293822 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/aggregator_to_gcs_operator.py"
!~      md5hash             = "XJkgbCLPyivP+4iiIstZYw==" -> (known after apply)
        name                = "plugins/operators/aggregator_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #220](https://github.com/cal-itp/data-infra/actions/runs/16203159763)